# AreOptionsValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..AreOptionsValid Method
DirectShapeType Class See Also
---
Validates that the given DirectShapeTypeOptions are allowed for this particular DirectShapeType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool AreOptionsValid(
	DirectShapeTypeOptions options
)
```

Visual Basic
---
```text
Public Function AreOptionsValid ( _
	options As DirectShapeTypeOptions _
) As Boolean
```

Visual C++
---
```text
public:
bool AreOptionsValid(
	DirectShapeTypeOptions^ options
)
```

# ### Parameters
options
    Type: Autodesk.Revit.DB..::..DirectShapeTypeOptions The options object.
# ### Return Value
True if the DirectShapeTypeOptions are valid; false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
Autodesk.Revit.DB Namespace